In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# 문자열 다루기
## 대소문자 변환 함수 (upper / lower / initcap)

1. 단일행 함수:  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;문자: upper, lower, initcap  
  
<br>

upper: 대문자로 출력하는 함수  
lower: 소문자로 출력하는 함수  
initcap: 첫 번째 철자는 대문자로 출력하고 나머지는 다 소문자로 출력하는 함수

In [3]:
%%sql

select upper(ename), lower(ename), initcap(ename)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 'king', 'King'),
 ('BLAKE', 'blake', 'Blake'),
 ('CLARK', 'clark', 'Clark'),
 ('JONES', 'jones', 'Jones'),
 ('MARTIN', 'martin', 'Martin'),
 ('ALLEN', 'allen', 'Allen'),
 ('TURNER', 'turner', 'Turner'),
 ('JAMES', 'james', 'James'),
 ('WARD', 'ward', 'Ward'),
 ('FORD', 'ford', 'Ford'),
 ('SMITH', 'smith', 'Smith'),
 ('SCOTT', 'scott', 'Scott'),
 ('ADAMS', 'adams', 'Adams'),
 ('MILLER', 'miller', 'Miller')]

문제 63. 우리반 테이블에서 통신사가 sk와 관련된 통신사이면 그 학생의 이름과 통신사를 출력하시오!   

(정확하게 데이터가 출력이 되어지게끔 SQL을 작성하시오)

In [11]:
%%sql

select replace(ename, substr(ename,2,1), '*') "이름",
       telecom "통신사"
    from emp12
    where lower(telecom) like 'sk%'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('현*연', 'sk'),
 ('성*창', 'SK'),
 ('유*영', 'skt'),
 ('구*모', 'sk'),
 ('김*순', 'skt'),
 ('허*민', 'sk'),
 ('이*성', 'sk'),
 ('정*원', 'sk'),
 ('권*원', 'sk'),
 ('양*준', 'sk')]

## 문자에서 특정 철자 추출하기(substr)


<br>

"substr( 컬럼, 글자의 위치, 몇개나 읽을 것인가 )"

In [12]:
%%sql

select replace(ename, substr(ename, 2, 1), '*') "이름",
        substr(ename, 1, 1) "성씨"
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('이*혁', '이'),
 ('한*', '한'),
 ('현*연', '현'),
 ('성*창', '성'),
 ('유*영', '유'),
 ('김*민', '김'),
 ('이*원', '이'),
 ('김*원', '김'),
 ('김*승', '김'),
 ('김*린', '김'),
 ('신*종', '신'),
 ('구*모', '구'),
 ('김*순', '김'),
 ('허*민', '허'),
 ('이*성', '이'),
 ('황*현', '황'),
 ('장*진', '장'),
 ('권*환', '권'),
 ('송*미', '송'),
 ('정*원', '정'),
 ('김*비', '김'),
 ('김*라', '김'),
 ('권*원', '권'),
 ('정*희', '정'),
 ('허*', '허'),
 ('양*준', '양'),
 ('김*원', '김')]

ex) 성씨가 이씨인 학생들의 이름을 출력하시오  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;like 쓰지말고 in 과 substr을 써서 출력하시오!

In [14]:
%%sql

select replace(ename, substr(ename, 2, 1), '*') "이름"
    from emp12
    where substr(ename, 1, 1) = '이'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('이*혁',), ('이*원',), ('이*성',)]

문제 64. 성씨가 김, 이, 유씨인 학생들의 이름과 나이를 출력하는데 like 쓰지 말고 in 과 substr을 써서 출력하시오!

In [25]:
%%sql

select replace(ename, substr(ename, 2, 1), '*') "이름", 
       substr(age,1,1)||'*' "나이"
    from emp12
    where substr(ename, 1, 1) in ('김','이','유')

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('이*혁', '2*'),
 ('유*영', '2*'),
 ('김*민', '2*'),
 ('이*원', '2*'),
 ('김*원', '2*'),
 ('김*승', '2*'),
 ('김*린', '2*'),
 ('김*순', '3*'),
 ('이*성', '2*'),
 ('김*비', '2*'),
 ('김*라', '2*'),
 ('김*원', '4*')]

## 문자열의 길이를 출력하기(Length)
" 철자의 길이를 출력하는 함수 "

문제 65. 우리반 테이블에서 이메일과 이메일의 철자의 길이를 출력하는데  
           이메일 철자의 길이가 가장 긴 것 부터 출력하시오

In [57]:
%%sql

select regexp_substr(email, '[a-z.,]+', instr(email, '@')+1) "이메일", 
       length(email) "길이"
    
    from emp12
    order by length(email) desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('gmail.com', 24),
 ('naver.com', 22),
 ('gmail.com', 21),
 ('naver.com', 21),
 ('naver.com', 21),
 ('gmail.com', 21),
 ('gmail.com', 20),
 ('naver,com', 20),
 ('naver.com', 20),
 ('gmail.com', 19),
 ('naver.com', 19),
 ('naver.com', 19),
 ('naver.com', 19),
 ('hanmail.net', 19),
 ('naver.com', 19),
 ('gmail.com', 19),
 ('naver.com', 18),
 ('naver.com', 18),
 ('naver.com', 18),
 ('naver.com', 18),
 ('naver.com', 18),
 ('naver.com', 18),
 ('naver.com', 18),
 ('naver.com', 17),
 ('gmail.com', 16),
 ('naver.com', 16),
 ('naver.com', 16)]

문제 66. emp 테이블에서 ename을 출력하고 그 옆에 ename 철자의 앞글자를 출력하시오

In [60]:
%%sql

select ename, substr(ename, 1, 1)
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 'K'),
 ('BLAKE', 'B'),
 ('CLARK', 'C'),
 ('JONES', 'J'),
 ('MARTIN', 'M'),
 ('ALLEN', 'A'),
 ('TURNER', 'T'),
 ('JAMES', 'J'),
 ('WARD', 'W'),
 ('FORD', 'F'),
 ('SMITH', 'S'),
 ('SCOTT', 'S'),
 ('ADAMS', 'A'),
 ('MILLER', 'M')]

문제 67. 위의 결과를 다시 출력하는 데 이름의 첫 번째 철자로 출력되는 부분을 소문자로 출력하시오!

In [61]:
%%sql

select ename, lower(substr(ename, 1, 1))
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 'k'),
 ('BLAKE', 'b'),
 ('CLARK', 'c'),
 ('JONES', 'j'),
 ('MARTIN', 'm'),
 ('ALLEN', 'a'),
 ('TURNER', 't'),
 ('JAMES', 'j'),
 ('WARD', 'w'),
 ('FORD', 'f'),
 ('SMITH', 's'),
 ('SCOTT', 's'),
 ('ADAMS', 'a'),
 ('MILLER', 'm')]

문제 68. 아래의 결과를 initcap 쓰지 말고 upper, lower, substr, ||를 사용해서 출력하시요  
   select initcap(ename)  
      from emp;

In [71]:
%%sql

select upper(substr(ename, 1, 1)) || lower(substr(ename,2)) "Name"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('King',),
 ('Blake',),
 ('Clark',),
 ('Jones',),
 ('Martin',),
 ('Allen',),
 ('Turner',),
 ('James',),
 ('Ward',),
 ('Ford',),
 ('Smith',),
 ('Scott',),
 ('Adams',),
 ('Miller',)]

문제 69. 사원테이블에서 이름을 출력하고 그 옆에 이름의 끝철자를 출력하는데 끝 철자를 소문자로 출력하시오!!

In [76]:
%%sql

select ename, lower(substr(ename, -1)) "last character"
    from emp

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', 'g'),
 ('BLAKE', 'e'),
 ('CLARK', 'k'),
 ('JONES', 's'),
 ('MARTIN', 'n'),
 ('ALLEN', 'n'),
 ('TURNER', 'r'),
 ('JAMES', 's'),
 ('WARD', 'd'),
 ('FORD', 'd'),
 ('SMITH', 'h'),
 ('SCOTT', 't'),
 ('ADAMS', 's'),
 ('MILLER', 'r')]

## 문자에서 특정 철자의 위치를 출력하기 (Instr)
" 특정 철자의 자릿수를 출력하는 함수"

Ex) 우리반 테이블에서 이메일을 출력하고 그 옆에
     이메일에서 @가 몇번째 자리에 있는지 출력하시오!

In [82]:
%%sql

select regexp_substr(email, '[a-z,.]+', instr(email, '@')) "email",
       instr(email, '@') as location
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('naver.com', 8),
 ('naver.com', 9),
 ('naver.com', 9),
 ('gmail.com', 10),
 ('naver.com', 9),
 ('naver.com', 13),
 ('gmail.com', 11),
 ('gmail.com', 12),
 ('gmail.com', 15),
 ('naver.com', 12),
 ('naver.com', 10),
 ('naver.com', 7),
 ('gmail.com', 12),
 ('hanmail.net', 8),
 ('naver,com', 11),
 ('naver.com', 10),
 ('naver.com', 10),
 ('naver.com', 9),
 ('naver.com', 9),
 ('naver.com', 7),
 ('naver.com', 10),
 ('naver.com', 11),
 ('gmail.com', 10),
 ('naver.com', 12),
 ('naver.com', 9),
 ('naver.com', 9),
 ('gmail.com', 7)]

문제 70. 이메일의 도메인을 출력하시오

In [84]:
%%sql

select regexp_substr(email, '[a-z.,]+', instr(email, '@')) "도메인"
    from emp12

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('naver.com',),
 ('naver.com',),
 ('naver.com',),
 ('gmail.com',),
 ('naver.com',),
 ('naver.com',),
 ('gmail.com',),
 ('gmail.com',),
 ('gmail.com',),
 ('naver.com',),
 ('naver.com',),
 ('naver.com',),
 ('gmail.com',),
 ('hanmail.net',),
 ('naver,com',),
 ('naver.com',),
 ('naver.com',),
 ('naver.com',),
 ('naver.com',),
 ('naver.com',),
 ('naver.com',),
 ('naver.com',),
 ('gmail.com',),
 ('naver.com',),
 ('naver.com',),
 ('naver.com',),
 ('gmail.com',)]

# 특정 철자를 다른 철자로 변경하기(REPLACE)
" 특정 철자를 다른 철자로 변경하는 함수 "